import { get } from "noname";

// threed 前缀技能翻译（附属条目紧跟主条目）
export const threedTranslate = {
	threed_cat_eye: "猫眼",
	"threed_cat_eye_info":
			"锁定技，你的回合内，牌堆底的牌与其他角色于此回合内获得的牌对你可见，其中你本轮内未以此法使用过的类型的牌于你可用。",
	threed_xiang_e: "享恶",
	"threed_xiang_e_info":
			"弃牌阶段结束时，若你于此阶段内：未弃置牌，你可以令一名其他角色执行一个弃牌阶段；弃置过牌，你可以令一名角色发动〖崩坏〗。",
	threed_zhi_luan: "织乱",
	"threed_zhi_luan_info":
			"你可以将【杀】当【借刀杀人】使用；你因此牌获得武器牌前，可以改为：你获得此牌目标一张牌，此牌目标获得你指定的【杀】的目标一张牌，你指定的【杀】的目标从牌堆底摸一张牌。",
	threed_xuyi1: "恤遗",
	"threed_xuyi1_info":
			"没有手牌的角色可以令你选择是否：与其各摸一张牌以令其视为使用【桃】；若其使用此【桃】时未处于濒死状态，其本局游戏不能再发动〖恤遗〗，且你改为将手牌摸至上限。",
	threed_xuyi1_use: "恤遗",
	threed_xuyi2: "序仪",
	"threed_xuyi2_info":
			"每种手牌数各限一次，你可以将所有手牌当【无懈可击】使用并令本局游戏你的手牌上限+1，然后你可以令一名手牌上限不小于你的角色摸两张牌。",
	threed_yuanzhen: "远振",
	"threed_yuanzhen_info":
			"锁定技，你使用牌指定与你距离不为1的其他角色为唯一目标后，或你成为与你距离不为1的其他角色使用牌的唯一目标后，你令其选择一项：1.你弃置其一张牌；2.令你摸一张牌。",
	threed_zhiyong: "制戎",
	"threed_zhiyong_info":
			"出牌阶段开始时，你可以将一名角色场上的一张装备牌置入另一名角色的装备区，然后前者视为对后者使用【过河拆桥】。",
};
