import { get } from "noname";

// xingyu 前缀技能翻译（附属条目紧跟主条目）
export const xingyuTranslate = {
	xingyu_haowu: "好武",
	xingyu_haowu_info:
			"当你获得武器牌后，你可以展示之，视为使用一张【杀】，且此【杀】结算中你可以发动该武器牌的技能。",
	xingyu_yingfeng: "英風",
	xingyu_yingfeng_info:
			"准备阶段，你可以依次重铸任意张不能造成伤害的牌，令你本回合增加等量的攻击范围。然后你可以依次使用其中能使用的牌。",
	xingyu_nizhan: "逆战",
	xingyu_nizhan_info:
			"出牌阶段限×次，你可以弃置一名手牌数大于你的角色一张手牌，若弃置的牌为【杀】，视为其对你使用一张【决斗】，此【决斗】双方打出【杀】的总数不能超过×（×为你的体力值）。",
	xingyu_chidan: "赤胆",
	xingyu_chidan_info:
			"锁定技，结束阶段，你将手牌摸或弃置至本回合你发动“逆战”的次数与你使用【杀】的次数之和。",
	xingyu_liefeng: "烈锋",
	xingyu_liefeng_info:
			"当你对其他角色造成伤害时，你可以失去1点体力，令此伤害+1。当你杀死角色时，你加1点体力上限并回复1点体力，然后失去“烈锋”。",
	xingyu_numang: "怒芒",
	xingyu_numang_info:
			"当你受到其他角色造成的伤害后，你可以弃置两张牌，对其造成1点伤害。当你处于濒死状态时，你加1点体力上限并回复体力至1点，然后失去“怒芒”。",
	xingyu_sujing: "肃靖",
	xingyu_sujing_info:
			"限定技，出牌阶段，你可以令任意名角色将手牌弃置至体力值。当你失去“烈锋”时，重置“肃靖”。",
	xingyu_shengwei: "盛威",
	xingyu_shengwei_info:
			"限定技，出牌阶段，你可以令任意名角色将手牌摸至体力上限。当你失去“怒芒”时，重置“盛威”。",
	xingyu_dubu: "独步",
	xingyu_dubu_info:
			"出牌阶段或当你受到伤害后，你可以减1点体力上限或废除一个装备栏，对你攻击范围内的一名角色造成1点伤害。每回合限一次。若你的体力上限不大于2，“独步”改为每回合限两次，且你发动“独步”可以额外扣减一名你距离1以内的角色的1点体力上限；若你的装备栏数不大于2，“独步”改为每回合限两次，且你发动“独步”可以额外废除一名你距离1以内的角色的一个装备栏。",
	xingyu_fanpu: "回戈",
	xingyu_fanpu_info:
			"其他角色的回合结束时，若你于本回合受到过伤害或失去了至少两张牌，你可以执行一个只能对其使用牌的回合。",
	xingyu_junyi: "俊逸",
	xingyu_junyi_info:
			"锁定技，若你的装备区里没有防具牌，你视为拥有“闭月”。",
	xingyu_taoxin: "饕心",
	xingyu_taoxin_info:
			"锁定技，其他角色的回合结束时，若你的手牌数不为全场最多，你获得弃牌堆中因其本回合弃置而置入的所有牌；你的回合开始时，若你的手牌数为全场最多，你执行“贾利”的一项。",
	xingyu_jiali: "贾利",
	xingyu_jiali_info:
			"每轮限一次，其他角色的回合开始时，你可以交给其一张牌，并令其选择一项：1. 执行一个额外的弃牌阶段，然后摸一张牌；2. 废除一个装备栏，并执行一个额外的出牌阶段。",
	xingyu_suifu: "绥抚",
	xingyu_suifu_info:
			"出牌阶段限一次，你可以令一名其他角色观看你区域里的所有牌，然后其可以展示其中一张并获得之。若此牌为基本牌，其可以视为使用任意一种基本牌，若使用的牌与其获得的牌牌名相同，你摸一张牌；若此牌为非基本牌，其可以使用之，若如此做，你于结束阶段摸×张牌并交给其一张牌（×为你已损失的体力值且至少为1）。",
	xingyu_jiyu: "戢羽",
	xingyu_jiyu_info:
			"一名角色的准备阶段，你可以弃置一张手牌并令其本回合计算与除其外的角色距离+×或-×（×为你的体力值），若你以此法弃置了最后的手牌，其选择令你回复1点体力，或你对其造成1点伤害。",
	xingyu_bogua: "卜卦",
	xingyu_bogua_info:
			"每轮限一次，一名角色的准备阶段，你可以判定，若为黑色/红色，则其使用和受到牌造成的伤害均+1/其至除其外的角色和除其外的角色至其的距离均-1，直到你的下个回合结束。",
	xingyu_juechou: "决仇",
	xingyu_juechou_info:
			"限定技，出牌阶段开始时，你可以指定攻击范围内一名体力值大于你的角色，本回合你可以将红色的牌当【杀】对其使用，且对其使用【杀】无次数限制。",
	xingyu_qianci: "谦辞",
	xingyu_qianci_info:
			"每回合限一次，当你获得一张【杀】/武器牌时，你可以弃置此牌，然后视为对一名角色使用一张【酒】/【桃】。",
	xingyu_qingke: "清恪",
	xingyu_qingke_info:
			"其他角色的出牌阶段开始时，你可以展示所有手牌并弃置一至两张牌，该角色可以交给你×张牌（×为你以此法弃置的牌数），然后若你的手牌花色各不相同，其可以执行以下一项：1.摸×张牌；2.本回合结束阶段可以获得至多×张其于本回合弃置的牌；3.弃置场上一张武器牌。",
	xingyu_qiaogong: "巧工",
	xingyu_qiaogong_info:
			"出牌阶段限一次，你可以令一名「装备区有牌的」「手牌数小于你的」角色摸一张牌。当你声明发动此技能前，你可以弃置一至三张装备牌，无视等量「」中的内容（按顺序：装备区有牌的→手牌数小于你的→限一次）且你多摸等量的牌。",
	xingyu_qinjian: "勤践",
	xingyu_qinjian_info:
			"当其他角色的一张装备牌因弃置或替换而置入弃牌堆时，若你对应的装备栏没有牌，你可以将该牌置入装备区。",
	xingyu_linan: "酾难",
	xingyu_linan_info:
			"其他角色使用仅指定自己为目标的基本牌或普通锦囊牌时，你可以翻面并成为此牌的额外目标。",
	xingyu_yinling: "吟翎",
	xingyu_yinling_info:
			"你仅成为过一张牌的目标的回合结束时，你可以视为使用一张与该牌牌名字数和为5的基本牌或普通锦囊牌；若你不处于【酒】状态，以此法使用的牌仅对一个目标生效。",
	xingyu_xianlue: "先略",
	xingyu_xianlue_info:
			"回合开始时，你可以摸一张牌并执行以下其中一项：1.视为使用任意一种普通锦囊牌；2.令一名与你势力相同的角色摸牌至体力上限（不超过五张）。然后此技能失效直到你进入濒死状态。",
	xingyu_fengwang: "奉王",
	xingyu_fengwang_info:
			"弃牌阶段开始时，你可以令一名与你势力相同的角色摸一张牌，然后本回合你的手牌上限与该角色相同。",
	xingyu_manyao: "蛮舞",
	xingyu_manyao_info:
			"锁定技，【南蛮入侵】对你无效；当一名角色使用【南蛮入侵】时，你摸一张牌。",
	xingyu_zhanyuan: "战缘",
	xingyu_zhanyuan_info:
			"其他角色的出牌阶段开始时，你可以无视目标限制对其使用一张牌，若此牌未造成伤害，其可以无视目标限制对你使用一张牌，若该牌未造成伤害，你可以与其各摸一张牌。",
	xingyu_niansi: "念嗣",
	xingyu_niansi_info:
			"准备阶段或男性角色受到伤害后其体力值不大于你时，你可以明置牌堆里的一张牌（自牌堆顶下数十张以内）。其他角色获得牌堆里明置的牌时，你可以令其摸一张牌，然后改为你获得这些牌。",
	xingyu_guju: "孤居",
	xingyu_guju_info:
			"你在回合外获得牌时可以弃置之，然后弃置当前回合角色区域里一张牌。若这些牌类别相同，你可以发动一次「念嗣」。",
	xingyu_jueyin: "绝姻",
	xingyu_jueyin_info:
			"限定技，摸牌阶段，你可以改为获得所有牌堆里明置的牌，然后令一名角色于其下一个回合使用的牌对你无效。",
	xingyu_xuquan: "虚权",
	xingyu_xuquan_info:
			"锁定技，准备阶段，你须指定至少×名其他角色（×为你已损失的体力值），这些角色依次将一张手牌置于牌堆顶。结束阶段，这些角色各摸一张牌。",
	xingyu_qizheng: "戚政",
	xingyu_qizheng_info:
			"锁定技，弃牌阶段结束时，你须令一名手牌最多或体力最多的其他角色获得你此阶段弃置的一张牌，若此牌花色为♥/♦/♣，本轮所有角色不能使用【桃】/【闪】/【无懈可击】。",
	xingyu_neizheng: "内争",
	// 子技能翻译（容器/标记技只需 name）
	xingyu_manyao1: "蛮舞",
	xingyu_manyao1_info: "",
	xingyu_manyao2: "蛮舞",
	xingyu_manyao2_info: "",
	xingyu_zhenzhe_mark: "震慑",
	xingyu_zhenzhe_mark_info: "",
	xingyu_yishi_mark_skill: "弈",
	xingyu_yishi_mark_skill_info: "",
	xingyu_leishen: "雷神",
	xingyu_leishen_info:
			"锁定技，你的黑色手牌视为雷【杀】，你使用的雷【杀】无次数限制。当你造成雷属性伤害后，你令所有其他角色依次亮出一张手牌，然后令所有未亮出【闪】的角色获得1枚「震慑」标记。",
	xingyu_leihong: "雷轰",
	xingyu_leihong_info:
			"出牌阶段开始时，你可以令所有拥有「震慑」标记且数量小于其体力上限的角色依次选择弃置×张牌或受到2点伤害（×为其体力上限数与其拥有的「震慑」标记数之差）。若如此做，你结束此阶段并移除所有「震慑」标记，废除一个装备栏。",
	xingyu_yishi: "弈势",
	xingyu_yishi_info:
			"锁定技，选将结束时，你令所有玩家将其备选武将牌置于其本局选择的武将牌旁，称为「弈」。",
	xingyu_nongju: "弄局",
	xingyu_nongju_info:
			"每回合限一次，在合适的场合，你可以移除一名角色的一张「弈」并执行以下其中一项：1.你发动此「弈」上的一项非标签技；2.其使用【杀】或普通锦囊牌时，改为你指定目标；3.其进入濒死状态时，以此「弈」替换其武将牌。",
	xingyu_niying: "匿影",
	xingyu_niying_info:
			"锁定技，你计算与其他角色的距离-×，其他角色计算与你的距离+×（×为其拥有的「弈」数）。",
	xingyu_duanjiang: "断江",
	xingyu_duanjiang_info:
			"你可以跳过判定阶段；其他角色需要打出【杀】或【闪】时，其可以将其判定区或装备区的一张牌移动至你的对应区域，视为其打出需要的牌。",
	xingyu_zoujiao: "走蛟",
	xingyu_zoujiao_info:
			"你可以跳过摸牌和出牌阶段，然后依次移动场上三张不同区域的牌；若此次移动的三张牌点数相连或花色相同，你摸三张牌。",
	xingyu_qulie: "驱烈",
	xingyu_qulie_info:
			"你可以跳过弃牌阶段，然后视为使用一张【南蛮入侵】或【万箭齐发】，目标角色响应此牌后，其可以令你弃置你区域内的一张牌。",
	xingyu_kaitian: "开天",
	xingyu_kaitian_info:
			"锁定技，本局游戏轮次由「阳」「星」轮次交替进行。第×个「阳」轮次开始时（×为场上存活角色数），你令一名角色获得所有角色各1点体力上限（其余角色各减1点体力上限，该角色加总减少量）。",
	xingyu_tuohai: "拓海",
	xingyu_tuohai_info:
			"出牌阶段限一次，你可以选择一名角色，除其外所有角色可以受到1点伤害并令其回复1点体力，若当前轮次为「阳」/「星」，这些角色本轮限两次，其可以将伤害类牌/两张红色牌当【决斗】/【桃】使用。",
	xingyu_dongdi: "动地",
	xingyu_dongdi_info:
			"当你受到1点伤害后，若当前轮次为「阳」/「星」，你可以将牌堆顶的一张牌当任意伤害类锦囊牌/非伤害且非体力回复类锦囊牌使用。「阳」「星」轮次交替时，你可以受到1点伤害并防止之。",
	xingyu_xiongzhi: "雄志",
	xingyu_xiongzhi_info:
			"锁定技，游戏开始时，你明置身份牌，你没有体力值，与你同阵营的其他角色均死亡前，你不会死亡。",
	xingyu_qingshi: "倾世",
	xingyu_qingshi_info:
			"锁定技，准备阶段，你视为使用一张【桃园结义】，当一名其他角色以此法回复体力时，你选择是否改为与其各摸一张牌。",
	xingyu_xuechou: "血仇",
	xingyu_xuechou_info:
			"觉醒技，与你同阵营的角色死亡后，你将「倾世」中的【桃园结义】改为【万箭齐发】。",
	xingyu_renwang: "仁望",
	xingyu_renwang_info:
			"主公技，「内奸」身份牌视为「忠臣」。",
};
